football_bingo/app/controllers/games_controller.rb

    def set_user_and_game
      @user = User.find(params[:user_id])
      @game = Game.find(params[:game_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", nil]]

    def set_games
      @games = Game.all
---
SELECT "games".* FROM "games"