football_bingo/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."user_id" = $1  [["user_id", 1]]
---
  def show
    # HARDCODED GAME
    @game_path = 'XML/tam.xml'
    #game_helper_load

    @user = User.find(params[:id])
    @cards = Card.where(user_id: @user.id)

UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "test22"], ["password_digest", "$2a$10$53Pb3lURT5br4fLQXTrc1OMa24fkbDGvbzRUrUER/kJ3787aMg9WK"], ["updated_at", "2019-03-23 13:43:41.860027"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)